## Plan Result (prod-cftapps_cluster_lb_backend_arm_tf)




<pre><code>Plan: 3 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_private_dns_a_record.appgw[&#34;plum-recipe-backend2-prod&#34;]
  * module.app-gw.azurerm_application_gateway.ag[1]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]
* Update
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_private_dns_a_record.appgw["plum-recipe-backend2-prod"] will be created
  + resource "azurerm_private_dns_a_record" "appgw" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "plum-recipe-backend2-prod"
      + records             = [
          + "10.90.96.110",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "service.core-compute-prod.internal"
    }

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.app-gw.azurerm_application_gateway.ag[1] will be created
  + resource "azurerm_application_gateway" "ag" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "aks01-prod-agw"
      + resource_group_name = "cft-prod-network-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + zones               = []

      + autoscale_configuration {
          + max_capacity = 10
          + min_capacity = 2
        }

      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.90.79.250",
              + "10.90.95.250",
            ]
          + name         = "plum-recipe-backend2"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "plum-recipe-backend2"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "plum-recipe-backend2"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "appGwPublicFrontendIp"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = (known after apply)
          + public_ip_address_id          = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/publicIPAddresses/aks-appgw-prod-pip-1"
          + subnet_id                     = (known after apply)
        }
      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "appGwPrivateFrontendIp"
          + private_ip_address            = "10.90.96.110"
          + private_ip_address_allocation = "Static"
          + public_ip_address_id          = (known after apply)
          + subnet_id                     = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/aks-appgw"
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "http"
          + port = 80
        }
      + frontend_port {
          + id   = (known after apply)
          + name = "https"
          + port = 443
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "gateway"
          + subnet_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/aks-appgw"
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "http"
          + host_name                      = "plum-recipe-backend2-prod.service.core-compute-prod.internal"
          + id                             = (known after apply)
          + name                           = "plum-recipe-backend2"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-prod-agw",
            ]
          + type         = "UserAssigned"
        }

      + probe {
          + host                                      = "plum-recipe-backend2-prod.service.core-compute-prod.internal"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "plum-recipe-backend2"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }

      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "plum-recipe-backend2"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "plum-recipe-backend2"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "plum-recipe-backend2"
          + id                         = (known after apply)
          + name                       = "plum-recipe-backend2"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      + sku {
          + name = "Standard_v2"
          + tier = "Standard_v2"
        }

      + ssl_certificate {
          + id                  = (known after apply)
          + key_vault_secret_id = "https://acmedcdcftappsprod.vault.azure.net/secrets/wildcard-platform-hmcts-net"
          + name                = "wildcard-platform-hmcts-net"
          + public_cert_data    = (known after apply)
        }

      + ssl_policy {
          + cipher_suites        = (known after apply)
          + disabled_protocols   = (known after apply)
          + min_protocol_version = (known after apply)
          + policy_name          = (known after apply)
          + policy_type          = (known after apply)
        }
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod"
      + name                       = "AppGw"
      + target_resource_id         = (known after apply)

      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label prod-cftapps_cluster_lb_backend_arm_tf/add-or-update: POST https://api.github.com/repos/hmcts/azure-platform-terraform/issues/1279/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":1279,"Program":"tfcmt","SHA1":"","Target":"prod-cftapps_cluster_lb_backend_arm_tf","Vars":{}} -->